Documents/ТранзакцииРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ТранзакцииРасходов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошелек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Указать</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецТранзакцииВыч</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЛогPOSTЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ЛогPOSTЗапросов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСостояния</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Кошелек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>Кошелек</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКошелька</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

HTTPServices/postTransactions/Ext/Module.bsl
функция СоздатьТранзакциюДоходов(ДанныеJSON)
	Док = Документы.ТранзакцииРасходов.СоздатьДокумент();
	Док.Дата = ТекущаяДата();
	Док.ВладелецТранзакцииСумм = ДанныеJSON.userName;
	Док.Счет = Справочники.Кошелек.НайтиПоКоду(ДанныеJSON.nameAccount).Ссылка;
	Док.Тип = Справочники.ТипыДоходов.НайтиПоКоду(ДанныеJSON.type).Ссылка;
	Док.Сумма = ДанныеJSON.sum;                                               
	Док.Описание = ДанныеJSON.description;
	Док.Записать();
КонецФункции


Функция ПровестиТранзакциюДоходов(ДанныеJSON)
	НовыйСчет = Справочники.Кошелек.НайтиПоКоду(ДанныеJSON.nameAccount).Ссылка;
	НовыйТип = Справочники.ТипыДоходов.НайтиПоКоду(ДанныеJSON.type).Ссылка;
	НовыйСумма = ДанныеJSON.sum;
	
	ОбьектСчета = НовыйСчет.ПолучитьОбъект();
	ОбъектСуммы = НовыйСчет.Сумма;
	
	СуммаНовогоСчета = ОбъектСуммы + НовыйСумма;
	ОбьектСчета.Сумма = СуммаНовогоСчета;
	ОбьектСчета.Записать();
КонецФункции


Функция transactionIncomePOST(Запрос)
	Попытка
		Ответ = Новый HTTPСервисОтвет(200);
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку());
		ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();                
		СоздатьТранзакциюДоходов(ДанныеJSON);
		ПровестиТранзакциюДоходов(ДанныеJSON);
	Исключение
		ОшибкаКода = ОписаниеОшибки();
		ЛогЗапросов = Документы.ЛогPOSTЗапросов.СоздатьДокумент();
		ЛогЗапросов.Дата = ТекущаяДата();
		ЛогЗапросов.Запрос = Запрос.ПолучитьТелоКакСтроку();
		ЛогЗапросов.Заголовки = Ответ.Заголовки;
		ЛогЗапросов.КодСостояния = Ответ.КодСостояния;
		ЛогЗапросов.Ошибка = ОшибкаКода;
		ЛогЗапросов.Записать();
	КонецПопытки;
	
	Возврат Ответ;
КонецФункции


/////////////////////////////////////////////////////////////////////////////////////////////////////


Функция СоздатьТранзакциюРасходы(ДанныеJSON)
	Док = Документы.ТранзакцииРасходов.СоздатьДокумент();
	Док.Дата = ТекущаяДата();  
	Док.ВладелецТранзакцииВыч = ДанныеJSON.userName;
	Док.Счет = Справочники.Кошелек.НайтиПоКоду(ДанныеJSON.nameAccount).Ссылка;
	Док.Тип = Справочники.ТипыДоходов.НайтиПоКоду(ДанныеJSON.type).Ссылка;
	Док.Сумма = ДанныеJSON.sum;                                               
	Док.Описание = ДанныеJSON.description;
	Док.Записать();	
КонецФункции 


Функция ПровестиТранзакциюРасходов(ДанныеJSON)
	СтатусСоздания = 200;
	НовыйСчет = Справочники.Кошелек.НайтиПоКоду(ДанныеJSON.nameAccount).Ссылка;
	НовыйТип = Справочники.ТипыДоходов.НайтиПоКоду(ДанныеJSON.type).Ссылка;
	НовыйСумма = ДанныеJSON.sum;
	
	ОбьектСчета = НовыйСчет.ПолучитьОбъект();
	ОбъектСуммы = НовыйСчет.Сумма;
	Если ОбъектСуммы < НовыйСумма Тогда
		СтатусСоздания = 406;
		Возврат СтатусСоздания;
	Иначе
		СуммаНовогоСчета = ОбъектСуммы - НовыйСумма;
		ОбьектСчета.Сумма = СуммаНовогоСчета;
		ОбьектСчета.Записать();
	КонецЕсли;
	
	Возврат СтатусСоздания
КонецФункции


Функция transactionExpensesPOST(Запрос)
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку());
		ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);
		Ответ = Новый HTTPСервисОтвет(ПровестиТранзакциюРасходов(ДанныеJSON));
		ЧтениеJSON.Закрыть(); 
		СоздатьТранзакциюРасходы(ДанныеJSON); 
	Исключение
		ОшибкаКода = ОписаниеОшибки();
		ЛогЗапросов = Документы.ЛогPOSTЗапросов.СоздатьДокумент();
		ЛогЗапросов.Дата = ТекущаяДата();
		ЛогЗапросов.Запрос = Запрос.ПолучитьТелоКакСтроку();
		ЛогЗапросов.Заголовки = Ответ.Заголовки;
		ЛогЗапросов.КодСостояния = Ответ.КодСостояния;
		ЛогЗапросов.Ошибка = ОшибкаКода;
		ЛогЗапросов.Записать();
	КонецПопытки;    
	
	Возврат Ответ;
КонецФункции
